package Collections;

/*        Коллекции - это хранилища,поддерживающие различные способы накопления и упорядочения объектов
с целью обеспечения эффективного доступа к ним.
        Коллекции в языке Java объединены в библиотеке классов java.util и предстовляют собой контейнеры, т.е. объекты,
которые группируют несколько элементов в отдельный модуль.
        Коллекции используются для хранения, поиска, манипулирования и передачи данных.
        Коллекции - это динамические массивы, связные списки, деревья, хэш-таблицы, стэки, очереди.

        Collections framework - это унифицированная архитектура для представления и манипулирования коллекциями.
        Collections framework содержит:
                -Интерфейсы
                -Классы - реализации (implementations)
                -Алгоритмы

       Важнейшие интерфейсы коллекций:
       Collection<E> - вершина иерархии типов коллекции
       List<E> - тип коллекции для обработки списков
       Set<E> - тип коллекции для обработки множеств
       Map<K,V> - тип коллекции - карта отображения вида "ключ-значение"

       Интерфейсы позволяют использовать коллекции независимо от деталей конкретной реализации,
       реализуя тем самым принци полиморфизма.
*/

public class CollectionsExample1 {

}
