package Collections;

/*        Коллекции - это хранилища,поддерживающие различные способы накопления и упорядочения объектов
с целью обеспечения эффективного доступа к ним.
        Коллекции в языке Java объединены в библиотеке классов java.util и предстовляют собой контейнеры, т.е. объекты,
которые группируют несколько элементов в отдельный модуль.
        Коллекции используются для хранения, поиска, манипулирования и передачи данных.
        Коллекции - это динамические массивы, связные списки, деревья, хэш-таблицы, стэки, очереди.

        Collections framework - это унифицированная архитектура для представления и манипулирования коллекциями.
        Collections framework содержит:
                -Интерфейсы
                -Классы - реализации (implementations)
                -Алгоритмы
*/

public class CollectionsExample1 {

}
